SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG22/Include/efr32fg22_rac.h
/* Bit fields for RAC TX */
#define _RAC_TX_RESETVALUE                                            0x00000000UL                                   /**< Default value for RAC_TX                    */
#define _RAC_TX_MASK                                                  0xE3CB00FFUL                                   /**< Mask for RAC_TX                             */
#define RAC_TX_TX0DBMENBLEEDPREDRVREG                                 (0x1UL << 0)                                   /**< TX0DBMENBLEEDPREDRVREG                      */
#define _RAC_TX_TX0DBMENBLEEDPREDRVREG_SHIFT                          0                                              /**< Shift value for RAC_TX0DBMENBLEEDPREDRVREG  */
#define _RAC_TX_TX0DBMENBLEEDPREDRVREG_MASK                           0x1UL                                          /**< Bit mask for RAC_TX0DBMENBLEEDPREDRVREG     */
#define _RAC_TX_TX0DBMENBLEEDPREDRVREG_DEFAULT                        0x00000000UL                                   /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_TX0DBMENBLEEDPREDRVREG_disable                        0x00000000UL                                   /**< Mode disable for RAC_TX                     */
#define _RAC_TX_TX0DBMENBLEEDPREDRVREG_enable                         0x00000001UL                                   /**< Mode enable for RAC_TX                      */
#define RAC_TX_TX0DBMENBLEEDPREDRVREG_DEFAULT                         (_RAC_TX_TX0DBMENBLEEDPREDRVREG_DEFAULT << 0)  /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_TX0DBMENBLEEDPREDRVREG_disable                         (_RAC_TX_TX0DBMENBLEEDPREDRVREG_disable << 0)  /**< Shifted mode disable for RAC_TX             */
#define RAC_TX_TX0DBMENBLEEDPREDRVREG_enable                          (_RAC_TX_TX0DBMENBLEEDPREDRVREG_enable << 0)   /**< Shifted mode enable for RAC_TX              */
#define RAC_TX_TX0DBMENBLEEDREG                                       (0x1UL << 1)                                   /**< TX0DBMENBLEEDREG                            */
#define _RAC_TX_TX0DBMENBLEEDREG_SHIFT                                1                                              /**< Shift value for RAC_TX0DBMENBLEEDREG        */
#define _RAC_TX_TX0DBMENBLEEDREG_MASK                                 0x2UL                                          /**< Bit mask for RAC_TX0DBMENBLEEDREG           */
#define _RAC_TX_TX0DBMENBLEEDREG_DEFAULT                              0x00000000UL                                   /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_TX0DBMENBLEEDREG_disable                              0x00000000UL                                   /**< Mode disable for RAC_TX                     */
#define _RAC_TX_TX0DBMENBLEEDREG_enable                               0x00000001UL                                   /**< Mode enable for RAC_TX                      */
#define RAC_TX_TX0DBMENBLEEDREG_DEFAULT                               (_RAC_TX_TX0DBMENBLEEDREG_DEFAULT << 1)        /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_TX0DBMENBLEEDREG_disable                               (_RAC_TX_TX0DBMENBLEEDREG_disable << 1)        /**< Shifted mode disable for RAC_TX             */
#define RAC_TX_TX0DBMENBLEEDREG_enable                                (_RAC_TX_TX0DBMENBLEEDREG_enable << 1)         /**< Shifted mode enable for RAC_TX              */
#define RAC_TX_TX0DBMENPREDRV                                         (0x1UL << 2)                                   /**< TX0DBMENPREDRV                              */
#define _RAC_TX_TX0DBMENPREDRV_SHIFT                                  2                                              /**< Shift value for RAC_TX0DBMENPREDRV          */
#define _RAC_TX_TX0DBMENPREDRV_MASK                                   0x4UL                                          /**< Bit mask for RAC_TX0DBMENPREDRV             */
#define _RAC_TX_TX0DBMENPREDRV_DEFAULT                                0x00000000UL                                   /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_TX0DBMENPREDRV_disable                                0x00000000UL                                   /**< Mode disable for RAC_TX                     */
#define _RAC_TX_TX0DBMENPREDRV_enable                                 0x00000001UL                                   /**< Mode enable for RAC_TX                      */
#define RAC_TX_TX0DBMENPREDRV_DEFAULT                                 (_RAC_TX_TX0DBMENPREDRV_DEFAULT << 2)          /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_TX0DBMENPREDRV_disable                                 (_RAC_TX_TX0DBMENPREDRV_disable << 2)          /**< Shifted mode disable for RAC_TX             */
#define RAC_TX_TX0DBMENPREDRV_enable                                  (_RAC_TX_TX0DBMENPREDRV_enable << 2)           /**< Shifted mode enable for RAC_TX              */
#define RAC_TX_TX0DBMENPREDRVREG                                      (0x1UL << 3)                                   /**< TX0DBMENPREDRVREG                           */
#define _RAC_TX_TX0DBMENPREDRVREG_SHIFT                               3                                              /**< Shift value for RAC_TX0DBMENPREDRVREG       */
#define _RAC_TX_TX0DBMENPREDRVREG_MASK                                0x8UL                                          /**< Bit mask for RAC_TX0DBMENPREDRVREG          */
#define _RAC_TX_TX0DBMENPREDRVREG_DEFAULT                             0x00000000UL                                   /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_TX0DBMENPREDRVREG_disable                             0x00000000UL                                   /**< Mode disable for RAC_TX                     */
#define _RAC_TX_TX0DBMENPREDRVREG_enable                              0x00000001UL                                   /**< Mode enable for RAC_TX                      */
#define RAC_TX_TX0DBMENPREDRVREG_DEFAULT                              (_RAC_TX_TX0DBMENPREDRVREG_DEFAULT << 3)       /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_TX0DBMENPREDRVREG_disable                              (_RAC_TX_TX0DBMENPREDRVREG_disable << 3)       /**< Shifted mode disable for RAC_TX             */
#define RAC_TX_TX0DBMENPREDRVREG_enable                               (_RAC_TX_TX0DBMENPREDRVREG_enable << 3)        /**< Shifted mode enable for RAC_TX              */
#define RAC_TX_TX0DBMENPREDRVREGBIAS                                  (0x1UL << 4)                                   /**< TX0DBMENPREDRVREGBIAS                       */
#define _RAC_TX_TX0DBMENPREDRVREGBIAS_SHIFT                           4                                              /**< Shift value for RAC_TX0DBMENPREDRVREGBIAS   */
#define _RAC_TX_TX0DBMENPREDRVREGBIAS_MASK                            0x10UL                                         /**< Bit mask for RAC_TX0DBMENPREDRVREGBIAS      */
#define _RAC_TX_TX0DBMENPREDRVREGBIAS_DEFAULT                         0x00000000UL                                   /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_TX0DBMENPREDRVREGBIAS_disable                         0x00000000UL                                   /**< Mode disable for RAC_TX                     */
#define _RAC_TX_TX0DBMENPREDRVREGBIAS_enable                          0x00000001UL                                   /**< Mode enable for RAC_TX                      */
#define RAC_TX_TX0DBMENPREDRVREGBIAS_DEFAULT                          (_RAC_TX_TX0DBMENPREDRVREGBIAS_DEFAULT << 4)   /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_TX0DBMENPREDRVREGBIAS_disable                          (_RAC_TX_TX0DBMENPREDRVREGBIAS_disable << 4)   /**< Shifted mode disable for RAC_TX             */
#define RAC_TX_TX0DBMENPREDRVREGBIAS_enable                           (_RAC_TX_TX0DBMENPREDRVREGBIAS_enable << 4)    /**< Shifted mode enable for RAC_TX              */
#define RAC_TX_TX0DBMENBIAS                                           (0x1UL << 5)                                   /**< TX0DBMENBIAS                                */
#define _RAC_TX_TX0DBMENBIAS_SHIFT                                    5                                              /**< Shift value for RAC_TX0DBMENBIAS            */
#define _RAC_TX_TX0DBMENBIAS_MASK                                     0x20UL                                         /**< Bit mask for RAC_TX0DBMENBIAS               */
#define _RAC_TX_TX0DBMENBIAS_DEFAULT                                  0x00000000UL                                   /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_TX0DBMENBIAS_disable                                  0x00000000UL                                   /**< Mode disable for RAC_TX                     */
#define _RAC_TX_TX0DBMENBIAS_enable                                   0x00000001UL                                   /**< Mode enable for RAC_TX                      */
#define RAC_TX_TX0DBMENBIAS_DEFAULT                                   (_RAC_TX_TX0DBMENBIAS_DEFAULT << 5)            /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_TX0DBMENBIAS_disable                                   (_RAC_TX_TX0DBMENBIAS_disable << 5)            /**< Shifted mode disable for RAC_TX             */
#define RAC_TX_TX0DBMENBIAS_enable                                    (_RAC_TX_TX0DBMENBIAS_enable << 5)             /**< Shifted mode enable for RAC_TX              */
#define RAC_TX_TX0DBMENRAMPCLK                                        (0x1UL << 6)                                   /**< TX0DBMENRAMPCLK                             */
#define _RAC_TX_TX0DBMENRAMPCLK_SHIFT                                 6                                              /**< Shift value for RAC_TX0DBMENRAMPCLK         */
#define _RAC_TX_TX0DBMENRAMPCLK_MASK                                  0x40UL                                         /**< Bit mask for RAC_TX0DBMENRAMPCLK            */
#define _RAC_TX_TX0DBMENRAMPCLK_DEFAULT                               0x00000000UL                                   /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_TX0DBMENRAMPCLK_disable                               0x00000000UL                                   /**< Mode disable for RAC_TX                     */
#define _RAC_TX_TX0DBMENRAMPCLK_enable                                0x00000001UL                                   /**< Mode enable for RAC_TX                      */
#define RAC_TX_TX0DBMENRAMPCLK_DEFAULT                                (_RAC_TX_TX0DBMENRAMPCLK_DEFAULT << 6)         /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_TX0DBMENRAMPCLK_disable                                (_RAC_TX_TX0DBMENRAMPCLK_disable << 6)         /**< Shifted mode disable for RAC_TX             */
#define RAC_TX_TX0DBMENRAMPCLK_enable                                 (_RAC_TX_TX0DBMENRAMPCLK_enable << 6)          /**< Shifted mode enable for RAC_TX              */
#define RAC_TX_TX0DBMENREG                                            (0x1UL << 7)                                   /**< TX0DBMENREG                                 */
#define _RAC_TX_TX0DBMENREG_SHIFT                                     7                                              /**< Shift value for RAC_TX0DBMENREG             */
#define _RAC_TX_TX0DBMENREG_MASK                                      0x80UL                                         /**< Bit mask for RAC_TX0DBMENREG                */
#define _RAC_TX_TX0DBMENREG_DEFAULT                                   0x00000000UL                                   /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_TX0DBMENREG_disable                                   0x00000000UL                                   /**< Mode disable for RAC_TX                     */
#define _RAC_TX_TX0DBMENREG_enable                                    0x00000001UL                                   /**< Mode enable for RAC_TX                      */
#define RAC_TX_TX0DBMENREG_DEFAULT                                    (_RAC_TX_TX0DBMENREG_DEFAULT << 7)             /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_TX0DBMENREG_disable                                    (_RAC_TX_TX0DBMENREG_disable << 7)             /**< Shifted mode disable for RAC_TX             */
#define RAC_TX_TX0DBMENREG_enable                                     (_RAC_TX_TX0DBMENREG_enable << 7)              /**< Shifted mode enable for RAC_TX              */
#define RAC_TX_TX6DBMENBLEEDPREDRVREG                                 (0x1UL << 16)                                  /**< TX6DBMENBLEEDPREDRVREG                      */
#define _RAC_TX_TX6DBMENBLEEDPREDRVREG_SHIFT                          16                                             /**< Shift value for RAC_TX6DBMENBLEEDPREDRVREG  */
#define _RAC_TX_TX6DBMENBLEEDPREDRVREG_MASK                           0x10000UL                                      /**< Bit mask for RAC_TX6DBMENBLEEDPREDRVREG     */
#define _RAC_TX_TX6DBMENBLEEDPREDRVREG_DEFAULT                        0x00000000UL                                   /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_TX6DBMENBLEEDPREDRVREG_disable                        0x00000000UL                                   /**< Mode disable for RAC_TX                     */
#define _RAC_TX_TX6DBMENBLEEDPREDRVREG_enable                         0x00000001UL                                   /**< Mode enable for RAC_TX                      */
#define RAC_TX_TX6DBMENBLEEDPREDRVREG_DEFAULT                         (_RAC_TX_TX6DBMENBLEEDPREDRVREG_DEFAULT << 16) /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_TX6DBMENBLEEDPREDRVREG_disable                         (_RAC_TX_TX6DBMENBLEEDPREDRVREG_disable << 16) /**< Shifted mode disable for RAC_TX             */
#define RAC_TX_TX6DBMENBLEEDPREDRVREG_enable                          (_RAC_TX_TX6DBMENBLEEDPREDRVREG_enable << 16)  /**< Shifted mode enable for RAC_TX              */
#define RAC_TX_TX6DBMENBLEEDREG                                       (0x1UL << 17)                                  /**< TX6DBMENBLEEDREG                            */
#define _RAC_TX_TX6DBMENBLEEDREG_SHIFT                                17                                             /**< Shift value for RAC_TX6DBMENBLEEDREG        */
#define _RAC_TX_TX6DBMENBLEEDREG_MASK                                 0x20000UL                                      /**< Bit mask for RAC_TX6DBMENBLEEDREG           */
#define _RAC_TX_TX6DBMENBLEEDREG_DEFAULT                              0x00000000UL                                   /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_TX6DBMENBLEEDREG_disable                              0x00000000UL                                   /**< Mode disable for RAC_TX                     */
#define _RAC_TX_TX6DBMENBLEEDREG_enable                               0x00000001UL                                   /**< Mode enable for RAC_TX                      */
#define RAC_TX_TX6DBMENBLEEDREG_DEFAULT                               (_RAC_TX_TX6DBMENBLEEDREG_DEFAULT << 17)       /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_TX6DBMENBLEEDREG_disable                               (_RAC_TX_TX6DBMENBLEEDREG_disable << 17)       /**< Shifted mode disable for RAC_TX             */
#define RAC_TX_TX6DBMENBLEEDREG_enable                                (_RAC_TX_TX6DBMENBLEEDREG_enable << 17)        /**< Shifted mode enable for RAC_TX              */
#define RAC_TX_TX6DBMENPREDRVREG                                      (0x1UL << 19)                                  /**< TX6DBMENPREDRVREG                           */
#define _RAC_TX_TX6DBMENPREDRVREG_SHIFT                               19                                             /**< Shift value for RAC_TX6DBMENPREDRVREG       */
#define _RAC_TX_TX6DBMENPREDRVREG_MASK                                0x80000UL                                      /**< Bit mask for RAC_TX6DBMENPREDRVREG          */
#define _RAC_TX_TX6DBMENPREDRVREG_DEFAULT                             0x00000000UL                                   /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_TX6DBMENPREDRVREG_disable                             0x00000000UL                                   /**< Mode disable for RAC_TX                     */
#define _RAC_TX_TX6DBMENPREDRVREG_enable                              0x00000001UL                                   /**< Mode enable for RAC_TX                      */
#define RAC_TX_TX6DBMENPREDRVREG_DEFAULT                              (_RAC_TX_TX6DBMENPREDRVREG_DEFAULT << 19)      /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_TX6DBMENPREDRVREG_disable                              (_RAC_TX_TX6DBMENPREDRVREG_disable << 19)      /**< Shifted mode disable for RAC_TX             */
#define RAC_TX_TX6DBMENPREDRVREG_enable                               (_RAC_TX_TX6DBMENPREDRVREG_enable << 19)       /**< Shifted mode enable for RAC_TX              */
#define RAC_TX_TX6DBMENRAMPCLK                                        (0x1UL << 22)                                  /**< TX6DBMENRAMPCLK                             */
#define _RAC_TX_TX6DBMENRAMPCLK_SHIFT                                 22                                             /**< Shift value for RAC_TX6DBMENRAMPCLK         */
#define _RAC_TX_TX6DBMENRAMPCLK_MASK                                  0x400000UL                                     /**< Bit mask for RAC_TX6DBMENRAMPCLK            */
#define _RAC_TX_TX6DBMENRAMPCLK_DEFAULT                               0x00000000UL                                   /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_TX6DBMENRAMPCLK_disable_clock                         0x00000000UL                                   /**< Mode disable_clock for RAC_TX               */
#define _RAC_TX_TX6DBMENRAMPCLK_enable_clock                          0x00000001UL                                   /**< Mode enable_clock for RAC_TX                */
#define RAC_TX_TX6DBMENRAMPCLK_DEFAULT                                (_RAC_TX_TX6DBMENRAMPCLK_DEFAULT << 22)        /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_TX6DBMENRAMPCLK_disable_clock                          (_RAC_TX_TX6DBMENRAMPCLK_disable_clock << 22)  /**< Shifted mode disable_clock for RAC_TX       */
#define RAC_TX_TX6DBMENRAMPCLK_enable_clock                           (_RAC_TX_TX6DBMENRAMPCLK_enable_clock << 22)   /**< Shifted mode enable_clock for RAC_TX        */
#define RAC_TX_TX6DBMENREG                                            (0x1UL << 23)                                  /**< TX6DBMENREG                                 */
#define _RAC_TX_TX6DBMENREG_SHIFT                                     23                                             /**< Shift value for RAC_TX6DBMENREG             */
#define _RAC_TX_TX6DBMENREG_MASK                                      0x800000UL                                     /**< Bit mask for RAC_TX6DBMENREG                */
#define _RAC_TX_TX6DBMENREG_DEFAULT                                   0x00000000UL                                   /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_TX6DBMENREG_disable                                   0x00000000UL                                   /**< Mode disable for RAC_TX                     */
#define _RAC_TX_TX6DBMENREG_enable                                    0x00000001UL                                   /**< Mode enable for RAC_TX                      */
#define RAC_TX_TX6DBMENREG_DEFAULT                                    (_RAC_TX_TX6DBMENREG_DEFAULT << 23)            /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_TX6DBMENREG_disable                                    (_RAC_TX_TX6DBMENREG_disable << 23)            /**< Shifted mode disable for RAC_TX             */
#define RAC_TX_TX6DBMENREG_enable                                     (_RAC_TX_TX6DBMENREG_enable << 23)             /**< Shifted mode enable for RAC_TX              */
#define RAC_TX_TX6DBMENPACORE                                         (0x1UL << 24)                                  /**< TX6DBMENPACORE                              */
#define _RAC_TX_TX6DBMENPACORE_SHIFT                                  24                                             /**< Shift value for RAC_TX6DBMENPACORE          */
#define _RAC_TX_TX6DBMENPACORE_MASK                                   0x1000000UL                                    /**< Bit mask for RAC_TX6DBMENPACORE             */
#define _RAC_TX_TX6DBMENPACORE_DEFAULT                                0x00000000UL                                   /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_TX6DBMENPACORE_disable                                0x00000000UL                                   /**< Mode disable for RAC_TX                     */
#define _RAC_TX_TX6DBMENPACORE_enable                                 0x00000001UL                                   /**< Mode enable for RAC_TX                      */
#define RAC_TX_TX6DBMENPACORE_DEFAULT                                 (_RAC_TX_TX6DBMENPACORE_DEFAULT << 24)         /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_TX6DBMENPACORE_disable                                 (_RAC_TX_TX6DBMENPACORE_disable << 24)         /**< Shifted mode disable for RAC_TX             */
#define RAC_TX_TX6DBMENPACORE_enable                                  (_RAC_TX_TX6DBMENPACORE_enable << 24)          /**< Shifted mode enable for RAC_TX              */
#define RAC_TX_TX6DBMENPAOUT                                          (0x1UL << 25)                                  /**< TX6DBMENPAOUT                               */
#define _RAC_TX_TX6DBMENPAOUT_SHIFT                                   25                                             /**< Shift value for RAC_TX6DBMENPAOUT           */
#define _RAC_TX_TX6DBMENPAOUT_MASK                                    0x2000000UL                                    /**< Bit mask for RAC_TX6DBMENPAOUT              */
#define _RAC_TX_TX6DBMENPAOUT_DEFAULT                                 0x00000000UL                                   /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_TX6DBMENPAOUT_disable                                 0x00000000UL                                   /**< Mode disable for RAC_TX                     */
#define _RAC_TX_TX6DBMENPAOUT_enable                                  0x00000001UL                                   /**< Mode enable for RAC_TX                      */
#define RAC_TX_TX6DBMENPAOUT_DEFAULT                                  (_RAC_TX_TX6DBMENPAOUT_DEFAULT << 25)          /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_TX6DBMENPAOUT_disable                                  (_RAC_TX_TX6DBMENPAOUT_disable << 25)          /**< Shifted mode disable for RAC_TX             */
#define RAC_TX_TX6DBMENPAOUT_enable                                   (_RAC_TX_TX6DBMENPAOUT_enable << 25)           /**< Shifted mode enable for RAC_TX              */
#define RAC_TX_ENXOSQBUFFILT                                          (0x1UL << 29)                                  /**< Override                                    */
#define _RAC_TX_ENXOSQBUFFILT_SHIFT                                   29                                             /**< Shift value for RAC_ENXOSQBUFFILT           */
#define _RAC_TX_ENXOSQBUFFILT_MASK                                    0x20000000UL                                   /**< Bit mask for RAC_ENXOSQBUFFILT              */
#define _RAC_TX_ENXOSQBUFFILT_DEFAULT                                 0x00000000UL                                   /**< Mode DEFAULT for RAC_TX                     */
